
===========================================================================
report_tns
============================================================================
tns -351.78

===========================================================================
report_wns
============================================================================
wns -8.87

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -8.87

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack -0.02
