
===========================================================================
report_tns
============================================================================
tns -330.64

===========================================================================
report_wns
============================================================================
wns -8.54

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -8.54

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack -0.04
