
===========================================================================
report_tns
============================================================================
tns -620.70

===========================================================================
report_wns
============================================================================
wns -7.87

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -7.87

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack -0.67
