
===========================================================================
report_tns
============================================================================
tns -1272.17

===========================================================================
report_wns
============================================================================
wns -8.98

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -8.98

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack -0.51
