###############################################################################
# Created by write_sdc
# Tue Jun 13 18:52:18 2023
###############################################################################
current_design peripheral_unit
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 12.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_in[0]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_in[10]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_in[11]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_in[12]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_in[13]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_in[14]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_in[15]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_in[16]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_in[17]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_in[18]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_in[19]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_in[1]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_in[20]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_in[21]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_in[22]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_in[23]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_in[2]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_in[3]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_in[4]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_in[5]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_in[6]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_in[7]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_in[8]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_in[9]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_access_err}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_addr[0]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_addr[10]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_addr[11]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_addr[12]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_addr[13]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_addr[14]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_addr[15]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_addr[16]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_addr[17]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_addr[18]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_addr[19]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_addr[1]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_addr[20]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_addr[21]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_addr[22]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_addr[23]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_addr[24]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_addr[25]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_addr[26]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_addr[27]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_addr[28]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_addr[29]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_addr[2]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_addr[30]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_addr[31]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_addr[3]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_addr[4]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_addr[5]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_addr[6]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_addr[7]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_addr[8]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_addr[9]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_be[0]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_be[1]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_be[2]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_be[3]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_req}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_wdata[0]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_wdata[10]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_wdata[11]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_wdata[12]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_wdata[13]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_wdata[14]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_wdata[15]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_wdata[16]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_wdata[17]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_wdata[18]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_wdata[19]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_wdata[1]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_wdata[20]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_wdata[21]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_wdata[22]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_wdata[23]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_wdata[24]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_wdata[25]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_wdata[26]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_wdata[27]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_wdata[28]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_wdata[29]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_wdata[2]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_wdata[30]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_wdata[31]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_wdata[3]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_wdata[4]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_wdata[5]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_wdata[6]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_wdata[7]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_wdata[8]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_wdata[9]}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_we}]
set_input_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {reset_n}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb_no[0]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb_no[10]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb_no[11]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb_no[12]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb_no[13]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb_no[14]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb_no[15]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb_no[16]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb_no[17]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb_no[18]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb_no[19]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb_no[1]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb_no[20]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb_no[21]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb_no[22]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb_no[23]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb_no[2]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb_no[3]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb_no[4]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb_no[5]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb_no[6]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb_no[7]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb_no[8]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb_no[9]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_out[0]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_out[10]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_out[11]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_out[12]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_out[13]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_out[14]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_out[15]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_out[16]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_out[17]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_out[18]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_out[19]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_out[1]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_out[20]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_out[21]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_out[22]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_out[23]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_out[2]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_out[3]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_out[4]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_out[5]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_out[6]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_out[7]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_out[8]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {io_out[9]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {me_i_en}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {mem_err_int}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[0]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[10]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[11]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[12]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[13]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[14]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[15]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[16]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[17]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[18]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[19]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[1]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[20]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[21]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[22]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[23]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[24]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[25]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[26]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[27]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[28]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[29]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[2]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[30]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[31]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[32]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[33]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[34]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[35]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[36]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[37]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[38]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[39]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[3]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[40]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[41]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[42]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[43]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[44]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[45]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[46]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[47]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[48]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[49]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[4]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[50]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[51]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[5]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[6]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[7]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[8]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_i_enable[9]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[0]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[10]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[11]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[12]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[13]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[14]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[15]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[16]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[17]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[18]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[19]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[1]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[20]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[21]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[22]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[23]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[24]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[25]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[26]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[27]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[28]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[29]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[2]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[30]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[31]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[32]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[33]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[34]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[35]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[36]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[37]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[38]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[39]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[3]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[40]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[41]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[42]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[43]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[44]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[45]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[46]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[47]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[48]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[49]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[4]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[50]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[51]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[5]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[6]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[7]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[8]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {p_interrupts[9]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_gnt}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_rdata[0]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_rdata[10]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_rdata[11]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_rdata[12]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_rdata[13]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_rdata[14]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_rdata[15]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_rdata[16]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_rdata[17]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_rdata[18]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_rdata[19]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_rdata[1]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_rdata[20]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_rdata[21]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_rdata[22]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_rdata[23]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_rdata[24]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_rdata[25]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_rdata[26]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_rdata[27]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_rdata[28]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_rdata[29]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_rdata[2]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_rdata[30]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_rdata[31]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_rdata[3]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_rdata[4]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_rdata[5]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_rdata[6]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_rdata[7]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_rdata[8]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_rdata[9]}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {peripheral_rvalid}]
set_output_delay 2.4000 -clock [get_clocks {clk}] -add_delay [get_ports {timer_intr}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {me_i_en}]
set_load -pin_load 0.0334 [get_ports {mem_err_int}]
set_load -pin_load 0.0334 [get_ports {peripheral_gnt}]
set_load -pin_load 0.0334 [get_ports {peripheral_rvalid}]
set_load -pin_load 0.0334 [get_ports {timer_intr}]
set_load -pin_load 0.0334 [get_ports {io_oeb_no[23]}]
set_load -pin_load 0.0334 [get_ports {io_oeb_no[22]}]
set_load -pin_load 0.0334 [get_ports {io_oeb_no[21]}]
set_load -pin_load 0.0334 [get_ports {io_oeb_no[20]}]
set_load -pin_load 0.0334 [get_ports {io_oeb_no[19]}]
set_load -pin_load 0.0334 [get_ports {io_oeb_no[18]}]
set_load -pin_load 0.0334 [get_ports {io_oeb_no[17]}]
set_load -pin_load 0.0334 [get_ports {io_oeb_no[16]}]
set_load -pin_load 0.0334 [get_ports {io_oeb_no[15]}]
set_load -pin_load 0.0334 [get_ports {io_oeb_no[14]}]
set_load -pin_load 0.0334 [get_ports {io_oeb_no[13]}]
set_load -pin_load 0.0334 [get_ports {io_oeb_no[12]}]
set_load -pin_load 0.0334 [get_ports {io_oeb_no[11]}]
set_load -pin_load 0.0334 [get_ports {io_oeb_no[10]}]
set_load -pin_load 0.0334 [get_ports {io_oeb_no[9]}]
set_load -pin_load 0.0334 [get_ports {io_oeb_no[8]}]
set_load -pin_load 0.0334 [get_ports {io_oeb_no[7]}]
set_load -pin_load 0.0334 [get_ports {io_oeb_no[6]}]
set_load -pin_load 0.0334 [get_ports {io_oeb_no[5]}]
set_load -pin_load 0.0334 [get_ports {io_oeb_no[4]}]
set_load -pin_load 0.0334 [get_ports {io_oeb_no[3]}]
set_load -pin_load 0.0334 [get_ports {io_oeb_no[2]}]
set_load -pin_load 0.0334 [get_ports {io_oeb_no[1]}]
set_load -pin_load 0.0334 [get_ports {io_oeb_no[0]}]
set_load -pin_load 0.0334 [get_ports {io_out[23]}]
set_load -pin_load 0.0334 [get_ports {io_out[22]}]
set_load -pin_load 0.0334 [get_ports {io_out[21]}]
set_load -pin_load 0.0334 [get_ports {io_out[20]}]
set_load -pin_load 0.0334 [get_ports {io_out[19]}]
set_load -pin_load 0.0334 [get_ports {io_out[18]}]
set_load -pin_load 0.0334 [get_ports {io_out[17]}]
set_load -pin_load 0.0334 [get_ports {io_out[16]}]
set_load -pin_load 0.0334 [get_ports {io_out[15]}]
set_load -pin_load 0.0334 [get_ports {io_out[14]}]
set_load -pin_load 0.0334 [get_ports {io_out[13]}]
set_load -pin_load 0.0334 [get_ports {io_out[12]}]
set_load -pin_load 0.0334 [get_ports {io_out[11]}]
set_load -pin_load 0.0334 [get_ports {io_out[10]}]
set_load -pin_load 0.0334 [get_ports {io_out[9]}]
set_load -pin_load 0.0334 [get_ports {io_out[8]}]
set_load -pin_load 0.0334 [get_ports {io_out[7]}]
set_load -pin_load 0.0334 [get_ports {io_out[6]}]
set_load -pin_load 0.0334 [get_ports {io_out[5]}]
set_load -pin_load 0.0334 [get_ports {io_out[4]}]
set_load -pin_load 0.0334 [get_ports {io_out[3]}]
set_load -pin_load 0.0334 [get_ports {io_out[2]}]
set_load -pin_load 0.0334 [get_ports {io_out[1]}]
set_load -pin_load 0.0334 [get_ports {io_out[0]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[51]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[50]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[49]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[48]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[47]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[46]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[45]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[44]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[43]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[42]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[41]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[40]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[39]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[38]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[37]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[36]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[35]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[34]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[33]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[32]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[31]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[30]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[29]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[28]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[27]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[26]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[25]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[24]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[23]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[22]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[21]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[20]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[19]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[18]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[17]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[16]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[15]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[14]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[13]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[12]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[11]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[10]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[9]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[8]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[7]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[6]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[5]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[4]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[3]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[2]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[1]}]
set_load -pin_load 0.0334 [get_ports {p_i_enable[0]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[51]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[50]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[49]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[48]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[47]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[46]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[45]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[44]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[43]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[42]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[41]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[40]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[39]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[38]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[37]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[36]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[35]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[34]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[33]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[32]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[31]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[30]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[29]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[28]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[27]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[26]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[25]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[24]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[23]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[22]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[21]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[20]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[19]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[18]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[17]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[16]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[15]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[14]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[13]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[12]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[11]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[10]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[9]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[8]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[7]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[6]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[5]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[4]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[3]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[2]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[1]}]
set_load -pin_load 0.0334 [get_ports {p_interrupts[0]}]
set_load -pin_load 0.0334 [get_ports {peripheral_rdata[31]}]
set_load -pin_load 0.0334 [get_ports {peripheral_rdata[30]}]
set_load -pin_load 0.0334 [get_ports {peripheral_rdata[29]}]
set_load -pin_load 0.0334 [get_ports {peripheral_rdata[28]}]
set_load -pin_load 0.0334 [get_ports {peripheral_rdata[27]}]
set_load -pin_load 0.0334 [get_ports {peripheral_rdata[26]}]
set_load -pin_load 0.0334 [get_ports {peripheral_rdata[25]}]
set_load -pin_load 0.0334 [get_ports {peripheral_rdata[24]}]
set_load -pin_load 0.0334 [get_ports {peripheral_rdata[23]}]
set_load -pin_load 0.0334 [get_ports {peripheral_rdata[22]}]
set_load -pin_load 0.0334 [get_ports {peripheral_rdata[21]}]
set_load -pin_load 0.0334 [get_ports {peripheral_rdata[20]}]
set_load -pin_load 0.0334 [get_ports {peripheral_rdata[19]}]
set_load -pin_load 0.0334 [get_ports {peripheral_rdata[18]}]
set_load -pin_load 0.0334 [get_ports {peripheral_rdata[17]}]
set_load -pin_load 0.0334 [get_ports {peripheral_rdata[16]}]
set_load -pin_load 0.0334 [get_ports {peripheral_rdata[15]}]
set_load -pin_load 0.0334 [get_ports {peripheral_rdata[14]}]
set_load -pin_load 0.0334 [get_ports {peripheral_rdata[13]}]
set_load -pin_load 0.0334 [get_ports {peripheral_rdata[12]}]
set_load -pin_load 0.0334 [get_ports {peripheral_rdata[11]}]
set_load -pin_load 0.0334 [get_ports {peripheral_rdata[10]}]
set_load -pin_load 0.0334 [get_ports {peripheral_rdata[9]}]
set_load -pin_load 0.0334 [get_ports {peripheral_rdata[8]}]
set_load -pin_load 0.0334 [get_ports {peripheral_rdata[7]}]
set_load -pin_load 0.0334 [get_ports {peripheral_rdata[6]}]
set_load -pin_load 0.0334 [get_ports {peripheral_rdata[5]}]
set_load -pin_load 0.0334 [get_ports {peripheral_rdata[4]}]
set_load -pin_load 0.0334 [get_ports {peripheral_rdata[3]}]
set_load -pin_load 0.0334 [get_ports {peripheral_rdata[2]}]
set_load -pin_load 0.0334 [get_ports {peripheral_rdata[1]}]
set_load -pin_load 0.0334 [get_ports {peripheral_rdata[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_access_err}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_req}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_we}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reset_n}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_in[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_in[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_in[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_in[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_in[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_in[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_in[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_in[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_in[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_in[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_in[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_in[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_in[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_in[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_in[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_in[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_in[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_in[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_in[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_in[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_in[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_in[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_in[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_in[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_addr[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_addr[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_addr[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_addr[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_addr[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_addr[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_addr[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_addr[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_addr[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_addr[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_addr[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_addr[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_addr[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_addr[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_addr[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_addr[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_addr[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_addr[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_addr[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_addr[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_addr[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_addr[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_addr[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_addr[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_addr[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_addr[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_addr[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_addr[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_addr[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_addr[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_addr[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_addr[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_be[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_be[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_be[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_be[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_wdata[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_wdata[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_wdata[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_wdata[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_wdata[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_wdata[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_wdata[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_wdata[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_wdata[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_wdata[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_wdata[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_wdata[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_wdata[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_wdata[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_wdata[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_wdata[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_wdata[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_wdata[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_wdata[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_wdata[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_wdata[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_wdata[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_wdata[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_wdata[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_wdata[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_wdata[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_wdata[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_wdata[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_wdata[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_wdata[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_wdata[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {peripheral_wdata[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 30.0000 [current_design]
