
===========================================================================
report_tns
============================================================================
tns -363.24

===========================================================================
report_wns
============================================================================
wns -8.88

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -8.88

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack -0.04
