
===========================================================================
report_tns
============================================================================
tns -319.05

===========================================================================
report_wns
============================================================================
wns -8.52

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -8.52

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack -0.03
