
===========================================================================
report_tns
============================================================================
tns -1800.04

===========================================================================
report_wns
============================================================================
wns -9.43

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -9.43

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack -0.58
