
===========================================================================
report_tns
============================================================================
tns -564.23

===========================================================================
report_wns
============================================================================
wns -7.51

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -7.51

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack -0.53
