
===========================================================================
report_tns
============================================================================
tns -392.75

===========================================================================
report_wns
============================================================================
wns -9.32

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -9.32

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack -0.02
