
===========================================================================
report_tns
============================================================================
tns -951.36

===========================================================================
report_wns
============================================================================
wns -8.55

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -8.55

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack -0.38
