
===========================================================================
report_tns
============================================================================
tns -299.39

===========================================================================
report_wns
============================================================================
wns -8.20

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -8.20

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack -0.04
